# TerraSigma
__Terraform converted Sigma rules. Providing the coverage of all Kusto backend supported Sigma rules and the DevOps practices provided from Terraform including state management, drift detection, and incremental deployment.__

### Usage:
**Clone the Sigma2KQL rules repository:**

``` powershell
git clone https://github.com/Khadinxc/Sigma2KQL.git
```

**Move into the cloned repo:**
``` powershell
cd .\Sigma2KQL
```

**Clone this repository:**
```
git clone https://github.com/Khadinxc/TerraSigma.git
```

**Create your Python virtual environment:**
```
python -m venv .venv
```

**Activate your Python virtual environment with Windows:**
``` powershell
.\.venv\Scripts\Activate.ps1
```

**Activate your Python virtual environment with Linux**
``` bash
./.venv/bin/activate
```

**Once in your Python virtual env:**

``` powershell
pip install -r requirements.txt
```

**Then you can use the script like this:**
``` powershell
python kql_to_terraform.py --kql-dir ./KQL --output-dir ./TF --schemas ./schemas.json
```

**This creates your initial set of Terraform structured detections.**


### Sample Rule:
``` terraform
resource "azurerm_sentinel_alert_rule_scheduled" "rule_7zip_compressing_dump_files" {
  name                       = "rule_7zip_compressing_dump_files"
  log_analytics_workspace_id = var.workspace_id
  display_name               = "7Zip Compressing Dump Files"
  description                = "Detects execution of 7z in order to compress a file with a \".dmp\"/\".dump\" extension, which could be a step in a process of dump file exfiltration. - Legitimate use of 7z with a command line in which \".dmp\" or \".dump\" appears accidentally - Legitimate use of 7z to compress WER \".dmp\" files for troubleshooting"
  severity                   = "Medium"
  query                      = <<QUERY
DeviceProcessEvents
| where (ProcessCommandLine contains ".dmp" or ProcessCommandLine contains ".dump" or ProcessCommandLine contains ".hdmp") and (ProcessVersionInfoFileDescription contains "7-Zip" or (FolderPath endswith "\\7z.exe" or FolderPath endswith "\\7zr.exe" or FolderPath endswith "\\7za.exe") or (ProcessVersionInfoOriginalFileName in~ ("7z.exe", "7za.exe")))
QUERY
  query_frequency            = "PT1H"
  query_period               = "PT1H"
  trigger_operator           = "GreaterThan"
  trigger_threshold          = 0
  suppression_enabled        = false
  suppression_duration       = "PT5H"
  tactics                    = ["Collection"]
  techniques                 = ["T1560"]
  enabled                    = true

  incident {
    create_incident_enabled = true
    grouping {
      enabled                 = false
      lookback_duration       = "PT5H"
      reopen_closed_incidents = false
      entity_matching_method  = "AllEntities"
      by_entities             = []
      by_alert_details        = []
      by_custom_details       = []
    }
  }

  event_grouping {
    aggregation_method = "SingleAlert"
  }

  entity_mapping {
    entity_type = "Process"
    field_mapping {
      identifier  = "CommandLine"
      column_name = "ProcessCommandLine"
    }
    field_mapping {
      identifier  = "ProcessName"
      column_name = "FileName"
    }
    field_mapping {
      identifier  = "ProcessPath"
      column_name = "FolderPath"
    }
  }

  entity_mapping {
    entity_type = "File"
    field_mapping {
      identifier  = "Name"
      column_name = "FileName"
    }
    field_mapping {
      identifier  = "Directory"
      column_name = "FolderPath"
    }
  }
}
```