id: 491ddeeb-c62f-55d7-bbc0-7173d0c6eb52
name: Invoke-Obfuscation STDIN+ Launcher
description: Detects Obfuscated use of stdin to execute PowerShell
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
- Execution
query: |-
  DeviceProcessEvents
  | where ProcessCommandLine matches regex "cmd.{0,5}(?:/c|/r).+powershell.+(?:\\$\\{?input\\}?|noexit).+\\""
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1027
- T1059
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
