id: 7855abe4-d70a-58df-8511-c8077dc283a3
name: Invoke-Obfuscation Via Stdin
description: Detects Obfuscated Powershell via Stdin in Scripts
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
- Execution
query: |-
  DeviceProcessEvents
  | where ProcessCommandLine matches regex "(?i)(set).*&&\\s?set.*(environment|invoke|\\$\\{?input).*&&.*""
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1027
- T1059
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
