id: d9b54ab7-b5c5-52e5-8ab7-a6624b2cd753
name: PowerShell Console History Logs Deleted
description: Detects the deletion of the PowerShell console History logs which may indicate an attempt to destroy forensic evidence
severity: Medium
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
query: |-
  DeviceFileEvents
  | where FolderPath endswith "\\PSReadLine\\ConsoleHost_history.txt"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1070
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
