id: 2c7ee238-f858-5943-bded-dd42bc71eaab
name: Visual Basic Command Line Compiler Usage
description: Detects successful code compilation via Visual Basic Command Line Compiler that utilizes Windows Resource to Object Converter. - Utilization of this tool should not be seen in enterprise environment
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
query: |-
  DeviceProcessEvents
  | where FolderPath endswith "\\cvtres.exe" and InitiatingProcessFolderPath endswith "\\vbc.exe"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1027
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
