id: 925a77e6-a1c1-5b1b-99d6-a70162e55089
name: Renamed Whoami Execution
description: Detects the execution of whoami that has been renamed to a different name to avoid detection
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- Discovery
query: |-
  DeviceProcessEvents
  | where ProcessVersionInfoOriginalFileName =~ "whoami.exe" and (not(FolderPath endswith "\\whoami.exe"))
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1033
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: ProcessName
    columnName: FileName
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Name
    columnName: FileName
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
