// Title: Potential COLDSTEEL Persistence Service DLL Creation
// Author: X__Junior (Nextron Systems)
// Date: 2023-04-30
// Level: high
// Description: Detects the creation of a file in a specific location and with a specific name related to COLDSTEEL RAT
// MITRE Tactic: Persistence
// Tags: attack.persistence, attack.defense-evasion, detection.emerging-threats

DeviceFileEvents
| where FolderPath endswith "\\AppData\\Roaming\\newdev.dll" and FolderPath startswith "C:\\Users\\"