id: a8249ea2-6104-59ba-a3c9-5c5fc6b8a4b7
name: HackTool - SILENTTRINITY Stager Execution
description: Detects SILENTTRINITY stager use via PE metadata - Unlikely
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- CommandAndControl
query: |-
  DeviceProcessEvents
  | where ProcessVersionInfoFileDescription contains "st2stager"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1071
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
