id: b6108cb0-815e-5934-bcbf-575731cf596a
name: HackTool - SILENTTRINITY Stager DLL Load
description: Detects SILENTTRINITY stager dll loading activity - Unlikely
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- CommandAndControl
query: |-
  DeviceImageLoadEvents
  | where InitiatingProcessVersionInfoFileDescription contains "st2stager"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1071
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceImageLoadEvents
