id: 0bc81f72-e0c4-5d42-8055-26be41caecea
name: Remote Access Tool - ScreenConnect Execution
description: 'An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks. These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment. Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land) - Legitimate usage of the tool'
severity: Medium
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- CommandAndControl
query: |-
  DeviceProcessEvents
  | where ProcessVersionInfoFileDescription =~ "ScreenConnect Service" or ProcessVersionInfoProductName =~ "ScreenConnect" or ProcessVersionInfoCompanyName =~ "ScreenConnect Software"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1219
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
