id: 8116c204-e05b-5ea2-bcd8-c0e522dcdb92
name: TeamViewer Remote Session
description: Detects the creation of log files during a TeamViewer remote session - Legitimate uses of TeamViewer in an organisation
severity: Medium
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- CommandAndControl
query: |-
  DeviceFileEvents
  | where (FolderPath endswith "\\TeamViewer\\RemotePrinting\\tvprint.db" or FolderPath endswith "\\TeamViewer\\TVNetwork.log") or (FolderPath contains "\\TeamViewer" and FolderPath contains "_Logfile.log")
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1219
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceFileEvents
