id: f7f92de5-f79f-5d13-b087-d45533acee0e
name: Remote Access Tool - Ammy Admin Agent Execution
description: Detects the execution of the Ammy Admin RMM agent for remote management. - Legitimate use of Ammy Admin RMM agent for remote management by admins.
severity: Medium
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- Execution
- Persistence
query: |-
  DeviceProcessEvents
  | where ProcessCommandLine contains "AMMYY\\aa_nts.dll\",run" and FolderPath endswith "\\rundll32.exe"
version: 1.0.0
kind: Scheduled
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
