id: fd20fea4-a1b4-5382-b920-516aa4590957
name: Hacktool Execution - PE Metadata
description: Detects the execution of different Windows based hacktools via PE metadata (company, product, etc.) even if the files have been renamed - Unlikely
severity: High
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- CredentialAccess
- ResourceDevelopment
query: |-
  DeviceProcessEvents
  | where ProcessVersionInfoCompanyName =~ "Cube0x0"
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1588
- T1003
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
