id: a00ece36-322b-5d9f-8fca-80d117e6e69b
name: SC.EXE Query Execution
description: Detects execution of "sc.exe" to query information about registered services on the system - Legitimate query of a service by an administrator to get more information such as the state or PID - Keybase process "kbfsdokan.exe" query the dokan1 service with the following commandline "sc query dokan1"
severity: Low
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- Discovery
query: |-
  DeviceProcessEvents
  | where (ProcessCommandLine contains " query" and (FolderPath endswith "\\sc.exe" and ProcessVersionInfoOriginalFileName =~ "sc.exe")) and (not(ProcessCommandLine =~ "sc query dokan1"))
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1007
entityMappings:
- entityType: Process
  fieldMappings:
  - identifier: CommandLine
    columnName: ProcessCommandLine
  - identifier: ProcessName
    columnName: FileName
  - identifier: ProcessPath
    columnName: FolderPath
- entityType: File
  fieldMappings:
  - identifier: Name
    columnName: FileName
  - identifier: Directory
    columnName: FolderPath
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceProcessEvents
