id: 6182ebf6-3234-5f6b-a2d9-01db16a98b78
name: Outgoing Logon with New Credentials
description: Detects logon events that specify new credentials - Legitimate remote administration activity
severity: Low
queryFrequency: PT1H
queryPeriod: PT1H
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
- LateralMovement
query: |-
  DeviceLogonEvents
  | where LogonType == 9
version: 1.0.0
kind: Scheduled
relevantTechniques:
- T1550
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceLogonEvents
