// Title: Potential Compromised 3CXDesktopApp Update Activity
// Author: Nasreddine Bencherchali (Nextron Systems)
// Date: 2023-03-29
// Level: high
// Description: Detects the 3CXDesktopApp updater downloading a known compromised version of the 3CXDesktopApp software
// MITRE Tactic: Defense Evasion
// Tags: attack.defense-evasion, attack.t1218, attack.execution, detection.emerging-threats

DeviceProcessEvents
| where (ProcessCommandLine contains "--update" and ProcessCommandLine contains "http" and ProcessCommandLine contains "/electron/update/win32/18.12") and FolderPath endswith "\\3CXDesktopApp\\app\\update.exe"